src/app/controllers/flags_controller.rb

SELECT "flags".* FROM "flags"
---
  def index
    @flags = Flag.all

INSERT INTO "flags" ("created_at", "owner", "prestige", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 19 Jan 2014 12:24:20 UTC +00:00], ["owner", 0], ["prestige", 0], ["updated_at", Sun, 19 Jan 2014 12:24:20 UTC +00:00]]
---
  def create
    @flag = Flag.new(flag_params)

    respond_to do |format|
      if @flag.save

DELETE FROM "flags" WHERE "flags"."id" = ?  [["id", 1]]
---
  def destroy
    @flag.destroy

SELECT "flags".* FROM "flags" WHERE "flags"."id" = ? LIMIT 1  [["id", "show"]]
---
    def set_flag
      @flag = Flag.find(params[:id])