src/app/controllers/flag_controller.rb

  def show

  #Flag
  cid = params[:id]
  # default Flag
  currentFlag = Flag.new
  currentFlag.id = cid
  currentFlag.prestige = 0

  #get owner
  dbflag = Flag.find_by_id(cid)
---
SELECT "flags".* FROM "flags" WHERE "flags"."id" = ? LIMIT 1  [["id", "353283351"]]